BusinessProcesses/ЗаявкаПриемНаРаботу.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<BusinessProcess>
		<Properties>
			<Name>ЗаявкаПриемНаРаботу</Name>
			<Task>Task.ПриказПриемНаРаботу</Task>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыБизнесПроцессыЗадачи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инициатор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отчество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Категория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииРаботников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Менеджеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>13</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПлановыеНачисления</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидРасчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыРасчетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Показатель1</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</BusinessProcess>
</MetaDataObject>

Enums/СтатусыБизнесПроцессыЗадачи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Enum>
		<Properties>
			<Name>СтатусыБизнесПроцессыЗадачи</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Новый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Утвержден</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отклонен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

BusinessProcesses/ЗаявкаПриемНаРаботу/Ext/ObjectModule.bsl
#Область Старт
Процедура СтартПередСтартом(ТочкаМаршрутаБизнесПроцесса, Отказ)
	
	Инициатор = ПараметрыСеанса.ТекущийПользователь;
	Статус = Перечисления.СтатусыБизнесПроцессыЗадачи.Новый;
	
КонецПроцедуры
#КонецОбласти

#Область Утверждение
Процедура УтверждениеПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	
	Для Каждого задача Из ФормируемыеЗадачи Цикл
		
		задача.Статус			 = Статус;
		задача.Инициатор		 = Инициатор;
		задача.Подразделение	 = Подразделение;
		задача.Фамилия			 = Фамилия;
		задача.Имя				 = Имя;
		задача.Отчество			 = Отчество;
		задача.Телефон			 = Телефон;
		задача.Категория		 = Категория;
		задача.Должность		 = Должность;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура УтверждениеПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	
	Статус			 = Задача.Статус;
	Инициатор		 = Задача.Инициатор;
	Фамилия			 = Задача.Фамилия;
	Имя				 = Задача.Имя;
	Отчество		 = Задача.Отчество;
	Телефон			 = Задача.Телефон;
	Подразделение	 = Задача.Подразделение;
	Категория		 = Задача.Категория;
	Должность		 = Задача.Должность;
	Менеджер		 = Задача.Менеджер;
	Контрагент		 = Задача.Контрагент;
	ФизЛицо			 = Задача.ФизЛицо;
	Сотрудник		 = Задача.Сотрудник;
	
	Записать();
	
КонецПроцедуры
#КонецОбласти

#Область ПроверкаУтверждения
Процедура ПроверкаУтвержденияПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	
	Если Статус = Перечисления.СтатусыБизнесПроцессыЗадачи.Утвержден Тогда
		Результат = Истина;
	КонецЕсли;
	
КонецПроцедуры
#КонецОбласти

Процедура ДополнителнениеПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	
	Для Каждого задача Из ФормируемыеЗадачи Цикл
		
		задача.Статус			 = Статус;
		задача.Инициатор		 = Инициатор;
		задача.Подразделение	 = Подразделение;
		задача.Фамилия			 = Фамилия;
		задача.Имя				 = Имя;
		задача.Отчество			 = Отчество;
		задача.Телефон			 = Телефон;
		задача.Категория		 = Категория;
		задача.Должность		 = Должность;
		задача.Менеджер			 = Менеджер;
		задача.Контрагент		 = Контрагент;
		задача.ФизЛицо			 = ФизЛицо;
		задача.Сотрудник		 = Сотрудник;
		
		задача.ПлановыеНачисления.Загрузить(Сотрудник.ПлановыеНачисления.Выгрузить());
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ДополнителнениеПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	
	Статус			 = Задача.Статус;
	Инициатор		 = Задача.Инициатор;
	Фамилия			 = Задача.Фамилия;
	Имя				 = Задача.Имя;
	Отчество		 = Задача.Отчество;
	Телефон			 = Задача.Телефон;
	Подразделение	 = Задача.Подразделение;
	Категория		 = Задача.Категория;
	Должность		 = Задача.Должность;
	Менеджер		 = Задача.Менеджер;
	Контрагент		 = Задача.Контрагент;
	ФизЛицо			 = Задача.ФизЛицо;
	Сотрудник		 = Задача.Сотрудник;
	
	Записать();
	
	сотрудникОбъект = Задача.Сотрудник.ПолучитьОбъект();
	сотрудникОбъект.Менеджер = Задача.Менеджер;
	сотрудникОбъект.ПлановыеНачисления.Загрузить(Задача.ПлановыеНачисления.Выгрузить());
	сотрудникОбъект.Записать();
	
КонецПроцедуры
